Repository: Trigan2025/rpyTranslations
Catalog: locale/*/rpyTranslations.po
Languages: fr

source: rpyTranslations reorder [--help] for_files... [options] for_files are the reference files where the translations need to be reordered. This command try regrouping similiar translations to ease translations and comprisons of equivalant translations. Since 'strings' translations are generaly unique, it should be note that it's only work for 'dialogs'. Also, all occurences are regrouping to the first occurence place. options: -h, --help Show this specific help for the 'reorder' command and exit. -o dir, --subdir dir If put, it indicate a sub-directory to where the reordered translation files are saved, otherwise on the for-files themself. -r, --reverse If put, try to reordering as it was originaly (as extracted by Ren'Py) through the reference-line comments (# dir/file.rpy:line). This functionality ignoring translation that are not have a reference-line comment, those selected to be reordered are joined and can be inserted between two group of these ignored translations. --proxy If put, this option make translations to be evaluated with a proxy method. With this method, translations are regrouped function of their normalized alpha-numeric representation. Please note that this option had no effect if put with the --reverse option. -v [lvl], --verbose [lvl] Activate the verbosity during the process. lvl can be pass to set the verbosity level, 1 for basic (default) or 2 for more verbosity. -d, --debug Activate the debug printings during the process.
fr: rpyTranslations reorder [--help] for_files... [options] for_files sont les fichiers de référence où les traductions doivent être réorganisées. Cette commande tente de regrouper des traductions similaires pour faciliter les traductions et les comparaisons de traductions équivalentes. Puisque les traductions 'strings' sont généralement uniques, il convient de noter que ça ne fonctionnent que pour les 'dialogues'. En outre, toutes les occurrences sont regroupées au premier emplacement d’occurrence. options: -h, --help Affiche cette aide spécifique pour la commande 'reorder' et quitte. -o dir, --subdir dir Si mis, il indique un sous-répertoire où les fichiers de traduction réorganisés sont enregistrés, sinon sur les for-files eux-mêmes. -r, --reverse Si mis, essaie de réorganiser comme c’était initialement (tel qu’extrait par Ren'Py) à l’aide des commentaires de référence de ligne (# dir/file.rpy:line). Cette fonctionnalité ignore les traductions qui n’ont pas de commentaire de ligne de référence, celles sélectionnées pour être réorganisées sont jointes et peuvent être insérées entre deux groupes de ces traductions ignorées. --proxy Si mis, cette option fait que les traductions soit évaluées avec une méthode proxy. Avec cette méthode, les traductions sont regroupées en fonction de leur représentation alphanumérique normalisée. Veuillez noter que cette option n’a aucun effet si elle est utilisée avec l’option --reverse. -v [lvl], --verbose [lvl] Active la verbosité durant le processus. lvl peut être passé pour définir le niveau de verbosité, 1 pour le niveau de base (par défaut) ou 2 pour plus de verbosité. -d, --debug Active les impressions de débogage durant le processus.

source: The file pair lists need to have equal length, {N} gived.
fr: Les listes de paires de fichiers doivent avoir une longueur égale, {N} donnée.

source: {} option should be an integer, give
fr: l’option {} doit être un entier, donné

source: An error occured:
fr: Une erreur s'est produite :
